pimple/fullTask/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0006940530789282125;

deltaT          1e-4;

writeControl    adjustable;

writeInterval         9.029805575602088e-05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{
    probes
    {
        type probes;
        libs ("libsampling.so");
        // writeInterval         9.029805575602088e-05; // записывать на каждом временном шаге

        probeLocations
        (
            (0 0 0.05) // точка на входе
            (0 0 0.55) // точка на выходе
        );
        fields (p);
    }
}
// ************************************************************************* //
