pimple/fullTask/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
        residualAlpha   1e-8;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi true;
    momentumPredictor true;
    turbOnFinalIterOnly false;
    consistent false;
    nOuterCorrectors 2;
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
//    solvePrimaryRegion    false;
//    iterToSolve           100;
    pRefCell        0;
    pRefValue       0;
    residualControl
    {
        p
        {
            tolerance 1e-2;
            relTol 0;
        }
        U
        {
            tolerance 1e-3;
            relTol 0;
        }
        k
        {
            tolerance 1e-3;
            relTol 0;
        }
        epsilon
        {
            tolerance 1e-3;
            relTol 0;
        }
        nuTilda
        {
            tolerance 1e-3;
            relTol 0;
        }
    }
}


// ************************************************************************* //
